[
  {
    "id": 1,
    "title": "The Serpent and the Wings of Night",
    "author": "Carissa Broadbent",
    "release_year": 2022,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Serpent+\nand+the+\nWings+of+Night",
    "price": {
      "base": 18.99,
      "discount_percent": 0,
      "final": 18.99
    },
    "category": {
      "main": "Paranormal Romance",
      "sub": "Vampire Romance"
    },
    "filters": {
      "magical_creatures": ["Vampires", "Humans"],
      "romance_intensity": "Explicit",
      "tropes": ["Forced Proximity", "Slow Burn", "Tournament Arc"]
    },
    "rating": 4.5,
    "popularity": 92,
    "tags": ["vampire romance", "paranormal romance", "fantasy tournament", "carissa broadbent", "enemies to lovers", "explicit"],
    "description": "A gripping tale of a human-vampire competition, love, and betrayal.",
    "long_description": "For humans and vampires, the rules of survival are the same: never trust, never yield, and always, always guard your heart. The adopted human daughter of the Nightborn vampire king, Oraya carved her station in a world designed to kill her. Her only chance to become something more than prey is to enter the Kejari, a legendary tournament held by the goddess of death herself. But winning will not be easy amongst the most vicious warriors from three vampire houses. To survive, Oraya is forced to make an alliance with a mysterious rival. Everything about Raihn is dangerous. He is a ruthless vampire, an efficient killer, an enemy to her father’s crown… and her greatest competition. Yet, what terrifies Oraya most of all is that she finds herself drawn to him.",
    "author_bio": "Carissa Broadbent has been concerning her family with stories of dragons, deities, and doomed romance since she was a small child. She is a graduate of the University of Massachusetts Amherst.",
    "tagline": "In the obsidian shadows, a deadly game begins.",
    "reviews": [
      { "user": "BookLover22", "rating": 5, "date": "2024-07-10", "text": "Absolutely devoured this book! The tension is incredible." },
      { "user": "FantasyFan", "rating": 4, "date": "2024-06-21", "text": "A great read, though the middle was a bit slow. The ending was fantastic!" }
    ]
  },
  {
    "id": 2,
    "title": "A Court of Thorns and Roses",
    "author": "Sarah J. Maas",
    "release_year": 2015,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=A+Court+of+\nThorns+and+Roses",
    "price": {
      "base": 16.50,
      "discount_percent": 0,
      "final": 16.50
    },
    "category": {
      "main": "Enchanted Worlds",
      "sub": "Fae Romance"
    },
    "filters": {
      "magical_creatures": ["Fae", "Humans", "Monsters"],
      "romance_intensity": "Spicy",
      "tropes": ["Enemies to Lovers", "Beauty and the Beast Retelling"]
    },
    "rating": 4.8,
    "popularity": 98,
    "tags": ["fae romance", "enemies to lovers", "fantasy romance", "beauty and the beast retelling", "high fantasy", "magic", "sarah j maas", "spicy"],
    "description": "A huntress's journey into the magical lands of the Fae to save her family.",
    "long_description": "When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows only from legends, Feyre discovers that her captor is not an animal, but Tamlin—one of the lethal, immortal faeries who once ruled their world. As she dwells on his estate, her feelings for Tamlin transform from icy hostility into a fiery passion that burns through every lie and warning she's been told about the beautiful, dangerous world of the Fae.",
    "author_bio": "Sarah J. Maas is the #1 New York Times and internationally bestselling author of the Crescent City, Court of Thorns and Roses, and Throne of Glass series.",
    "tagline": "Love is a curse that will not be broken.",
    "reviews": [
      { "user": "RomanceReader", "rating": 5, "date": "2024-08-01", "text": "A modern classic. The world-building is second to none." }
    ]
  },
  {
    "id": 3,
    "title": "Fourth Wing",
    "author": "Rebecca Yarros",
    "release_year": 2023,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=Fourth+Wing",
    "price": {
      "base": 22.00,
      "discount_percent": 0,
      "final": 22.00
    },
    "category": {
      "main": "Epic Fantasy Romance",
      "sub": "Dragon Rider Romance"
    },
    "filters": {
      "magical_creatures": ["Dragons", "Humans", "Gryphons"],
      "romance_intensity": "Spicy",
      "tropes": ["Enemies to Lovers", "Forbidden Love", "War College"]
    },
    "rating": 4.9,
    "popularity": 99,
    "tags": ["dragon rider", "fantasy romance", "enemies to lovers", "war college", "rebecca yarros", "magic", "spicy"],
    "description": "Violet Sorrengail must survive the brutal and elite world of a war college for dragon riders.",
    "long_description": "Twenty-year-old Violet Sorrengail was supposed to live a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders. But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.",
    "author_bio": "Rebecca Yarros is a hopeless romantic and lover of all things chocolate, coffee, and Paleo. She is the author of over fifteen novels.",
    "tagline": "Enter the world of dragons, or die trying.",
    "reviews": [
      { "user": "DragonMaster", "rating": 5, "date": "2024-07-15", "text": "Non-stop action and an incredible magic system. I couldn't put it down!" },
      { "user": "Bookworm_Bex", "rating": 5, "date": "2024-07-12", "text": "The hype is real. This book is everything." }
    ]
  },
  {
    "id": 4,
    "title": "The Last Shadow Weaver",
    "author": "Elara Vance",
    "release_year": 2024,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Last+\nShadow+Weaver",
    "price": {
      "base": 19.99,
      "discount_percent": 15,
      "final": 16.99
    },
    "category": {
      "main": "Dark Romance",
      "sub": "Enemies to Lovers"
    },
    "filters": {
      "magical_creatures": ["Shadow Demons", "Humans", "Elementals"],
      "romance_intensity": "Spicy",
      "tropes": ["Forbidden Power", "Secret Identity", "Forced Alliance"]
    },
    "rating": 4.7,
    "popularity": 88,
    "tags": ["dark romance", "shadow magic", "enemies to lovers", "forbidden power", "spicy", "morally grey hero"],
    "description": "In a world where shadow magic is a death sentence, Lyra is the last of her kind, hiding her power behind a quiet life. But when the tyrannical Sunstone Empire captures her brother, her only hope is to ally with Kai, the Emperor's ruthless and enigmatic assassin. He despises everything she is, yet their shared desire for vengeance pulls them into a dangerous dance of secrets and shadows. As they journey into the heart of the empire, the line between hatred and passion blurs, and Lyra must decide if trusting her sworn enemy is worth the price of her soul."
  },
  {
    "id": 5,
    "title": "The Iron Prince of the Fae Court",
    "author": "Rhys Corvid",
    "release_year": 2023,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Iron+Prince+\nof+the+Fae+Court",
    "price": {
      "base": 17.99,
      "discount_percent": 0,
      "final": 17.99
    },
    "category": {
      "main": "Urban Fantasy Love",
      "sub": "Fae Romance"
    },
    "filters": {
      "magical_creatures": ["Fae", "Humans", "Goblins"],
      "romance_intensity": "Medium",
      "tropes": ["Hidden Royalty", "Fish Out of Water", "Political Intrigue"]
    },
    "rating": 4.4,
    "popularity": 85,
    "tags": ["urban fantasy", "fae romance", "political intrigue", "hidden royalty", "modern fantasy"],
    "description": "Callum is a struggling artist in New York City, unaware that the Fae courts are hidden in plain sight. His life is upended when he's discovered to be the long-lost heir to the Iron Court, a kingdom of exiled Fae living in the city's underbelly. Thrown into a world of treacherous politics and ancient magic, he must navigate alliances with a court that sees him as an outsider. His only guide is Elara, a fierce Fae warrior who believes he's a weakness her court can't afford. But as they work together to protect their people from a rival court, their animosity sparks into an unexpected and forbidden connection."
  },
  {
    "id": 6,
    "title": "The Star-Crossed Siren",
    "author": "Marina Celeste",
    "release_year": 2024,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Star-Crossed+\nSiren",
    "price": {
      "base": 18.99,
      "discount_percent": 10,
      "final": 17.09
    },
    "category": {
      "main": "Forbidden Love",
      "sub": "Mythical Romance"
    },
    "filters": {
      "magical_creatures": ["Sirens", "Celestials", "Sea Monsters"],
      "romance_intensity": "Sweet",
      "tropes": ["Forbidden Love", "Star-Crossed Lovers", "Secret World"]
    },
    "rating": 4.6,
    "popularity": 82,
    "tags": ["siren", "mythical romance", "forbidden love", "star-crossed lovers", "celestial magic", "sweet romance"],
    "description": "Lira has spent her life in the abyssal depths, her siren song a lure for doomed sailors. But unlike her sisters, she dreams of the stars, not the sea. One night, she rescues a man who has fallen from the sky—a celestial being named Orion, tasked with charting the constellations. Stranded in her world, he is forbidden from consorting with mortals, and she is bound to the ocean. They form a secret bond, sharing stories of their two worlds. Their love is impossible, a defiance of the laws of both sea and sky. As their feelings deepen, they must challenge fate itself to find a way to be together, before their respective worlds tear them apart forever."
  },
  {
    "id": 7,
    "title": "The Alchemist's Heart",
    "author": "Julian Croft",
    "release_year": 2022,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Alchemist's+\nHeart",
    "price": {
      "base": 15.99,
      "discount_percent": 0,
      "final": 15.99
    },
    "category": {
      "main": "Enchanted Worlds",
      "sub": "Steampunk Romance"
    },
    "filters": {
      "magical_creatures": ["Humans", "Automatons"],
      "romance_intensity": "Medium",
      "tropes": ["Grumpy/Sunshine", "Academic Rivals", "Mystery"]
    },
    "rating": 4.3,
    "popularity": 75,
    "tags": ["steampunk romance", "alchemy", "academic rivals", "mystery", "enchanted worlds", "grumpy sunshine"],
    "description": "In the gaslit city of Aethel, renowned alchemist Elias Thorne is a man of logic and precision, haunted by his failure to create the legendary Philosopher's Stone. His quiet research is interrupted by Clara, a brilliant and insufferably cheerful botanist who claims to have found a flower with impossible properties. As academic rivals forced to work together, they uncover a conspiracy that threatens the city's magical core. Elias finds his logical world turned upside down by Clara's chaotic optimism, while she sees a hidden warmth beneath his grumpy exterior. Their intellectual sparring soon ignites into a deeper connection, as they realize the greatest discovery isn't the stone, but the magic they create together."
  },
  {
    "id": 8,
    "title": "The Werewolf's Vow",
    "author": "Luna Blackwood",
    "release_year": 2023,
    "cover_image": "https://placehold.co/400x600/1A1A2E/FFFFFF/png?text=The+Werewolf's+\nVow",
    "price": {
      "base": 17.99,
      "discount_percent": 5,
      "final": 17.09
    },
    "category": {
      "main": "Paranormal Romance",
      "sub": "Shifter Romance"
    },
    "filters": {
      "magical_creatures": ["Werewolves", "Humans", "Witches"],
      "romance_intensity": "Spicy",
      "tropes": ["Fated Mates", "Protector Hero", "Forced Proximity"]
    },
    "rating": 4.5,
    "popularity": 90,
    "tags": ["werewolf romance", "shifter romance", "fated mates", "paranormal romance", "protector", "spicy"],
    "description": "Isolde is an outcast in her village, feared for the dormant magic she possesses. When a monstrous beast terrorizes their lands, the villagers offer her as a sacrifice. She is rescued by Fenrir, the stoic and powerful alpha of the local werewolf pack. He recognizes her not as a sacrifice, but as his fated mate, a truth his pack is unwilling to accept. Bound by his vow to protect her, Fenrir brings Isolde into his world of pack law and ancient traditions. As Isolde's magic awakens under the moon's glow, she must earn her place in the pack while navigating the intense, primal bond she shares with a man who is more wolf than human. Their love is a defiance of both their worlds, and a beacon against the growing darkness."
  }
]
